# =============================================================================
# Brewfile - Declarative package management
# =============================================================================
# Install with: brew bundle --file=~/.local/share/chezmoi/Brewfile
# This runs automatically via chezmoi's run_once script


# -----------------------------------------------------------------------------
# Core TUI Tools
# -----------------------------------------------------------------------------

# Editor
brew "neovim"

# Diff tool
brew "difftastic"

# Terminal multiplexer
brew "tmux"

# Git TUI
brew "lazygit"

# File manager
brew "yazi"
brew "ffmpegthumbnailer"  # Video thumbnails for yazi
brew "unar"               # Archive preview for yazi
brew "poppler"            # PDF preview for yazi

# Fuzzy finder
brew "fzf"

# Fast grep (used by fzf and nvim)
brew "ripgrep"

# Kubernetes TUI
brew "k9s"

# -----------------------------------------------------------------------------
# Supporting Tools
# -----------------------------------------------------------------------------

# Better cat
brew "bat"

# Better ls
brew "eza"

# JSON processor
brew "jq"

# Process viewer
brew "htop"

# Git (ensure latest version)
brew "git"

# GitHub CLI (useful for auth)
brew "gh"

# Tree view
brew "tree"

# Watch command
brew "watch"

# -----------------------------------------------------------------------------
# Development Dependencies
# -----------------------------------------------------------------------------

# Required for building some packages
brew "cmake"
brew "gcc"

# Node.js (required by some nvim plugins like copilot)
brew "node"

# -----------------------------------------------------------------------------
# Dotfiles Management
# -----------------------------------------------------------------------------

brew "chezmoi"
